### ✅ terraform apply output

<details><summary>Show Details</summary>

```
[0m[1mmodule.vcl_service.fastly_service_vcl.main: Refreshing state... [id=2zEiTVx1IaiqZ4ptgxwnw3][0m

[1m[36mNote:[0m[1m Objects have changed outside of Terraform
[0m
Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

[1m  # module.vcl_service.fastly_service_vcl.main[0m has been deleted
[0m  [31m-[0m[0m resource "fastly_service_vcl" "main" {
      [31m-[0m[0m active_version     = 3 [90m-> null[0m[0m
      [31m-[0m[0m id                 = "2zEiTVx1IaiqZ4ptgxwnw3" [90m-> null[0m[0m
        name               = "webinar202407-dev"
        [90m# (12 unchanged attributes hidden)[0m[0m

        [90m# (3 unchanged blocks hidden)[0m[0m
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.
[90m
─────────────────────────────────────────────────────────────────────────────[0m

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  [32m+[0m create[0m

Terraform will perform the following actions:

[1m  # module.vcl_service.fastly_service_vcl.main[0m will be created
[0m  [32m+[0m[0m resource "fastly_service_vcl" "main" {
      [32m+[0m[0m activate           = true
      [32m+[0m[0m active_version     = (known after apply)
      [32m+[0m[0m cloned_version     = (known after apply)
      [32m+[0m[0m comment            = "Managed by Terraform"
      [32m+[0m[0m default_ttl        = 3600
      [32m+[0m[0m force_destroy      = true
      [32m+[0m[0m force_refresh      = (known after apply)
      [32m+[0m[0m http3              = false
      [32m+[0m[0m id                 = (known after apply)
      [32m+[0m[0m imported           = (known after apply)
      [32m+[0m[0m name               = "webinar202407-dev"
      [32m+[0m[0m stale_if_error     = false
      [32m+[0m[0m stale_if_error_ttl = 43200
      [32m+[0m[0m version_comment    = <<-EOT
            PR#1
            https://github.com/hkakehashi/webinar-202407/pull/1
        EOT

      [32m+[0m[0m backend {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }

      [32m+[0m[0m domain {
          [32m+[0m[0m name    = "webinar202407-dev.global.ssl.fastly.net"
            [90m# (1 unchanged attribute hidden)[0m[0m
        }

      [32m+[0m[0m vcl {
          [32m+[0m[0m content = <<-EOT
                sub vcl_recv {
                #FASTLY recv
                
                  # Normally, you should consider requests other than GET and HEAD to be uncacheable
                  # (to this we add the special FASTLYPURGE method)
                  if (req.method != "HEAD" && req.method != "GET" && req.method != "FASTLYPURGE") {
                    return(pass);
                  }
                
                  # If you are using image optimization, insert the code to enable it here
                  # See https://www.fastly.com/documentation/reference/io/ for more information.
                
                  return(lookup);
                }
                
                sub vcl_hash {
                  set req.hash += req.url;
                  set req.hash += req.http.host;
                #FASTLY hash
                  return(hash);
                }
                
                sub vcl_hit {
                #FASTLY hit
                  return(deliver);
                }
                
                sub vcl_miss {
                #FASTLY miss
                  return(fetch);
                }
                
                sub vcl_pass {
                #FASTLY pass
                  return(pass);
                }
                
                sub vcl_fetch {
                
                  # Unset headers that reduce cacheability for images processed using the Fastly image optimizer
                  if (req.http.X-Fastly-Imageopto-Api) {
                    unset beresp.http.Set-Cookie;
                    unset beresp.http.Vary;
                  }
                
                  # Log the number of restarts for debugging purposes
                  if (req.restarts > 0) {
                    set beresp.http.Fastly-Restarts = req.restarts;
                  }
                
                  # If the response is setting a cookie, make sure it is not cached
                  if (beresp.http.Set-Cookie) {
                    return(pass);
                  }
                
                  # By default we set a TTL based on the `Cache-Control` header but we don't parse additional directives
                  # like `private` and `no-store`. Private in particular should be respected at the edge:
                  if (beresp.http.Cache-Control ~ "(?:private|no-store)") {
                    return(pass);
                  }
                
                  # If no TTL has been provided in the response headers, set a default
                  if (http_status_matches(beresp.status, "200,206,301,302")) {
                    if (!beresp.http.Cache-Control) {
                      set beresp.ttl = 86400s;
                      set beresp.http.Cache-Control = "max-age=86400";
                
                      # Apply a longer default TTL for images processed using Image Optimizer
                      if (req.http.X-Fastly-Imageopto-Api) {
                        set beresp.ttl = 2592000s; # 30 days
                        set beresp.http.Cache-Control = "max-age=2592000, public";
                      }
                    }
                  }
                
                  return(deliver);
                }
                
                sub vcl_error {
                #FASTLY error
                  return(deliver);
                }
                
                sub vcl_deliver {
                #FASTLY deliver
                
                  if (req.http.Fastly-Debug) {
                    set resp.http.Fastly-Debug-VCL-Version = req.vcl.version;
                  }
                
                  return(deliver);
                }
                
                sub vcl_log {
                #FASTLY log
                }
            EOT
          [32m+[0m[0m main    = true
          [32m+[0m[0m name    = "main"
        }
    }

[1mPlan:[0m 1 to add, 0 to change, 0 to destroy.
[0m
Changes to Outputs:
  [32m+[0m[0m active_version = (known after apply)
  [32m+[0m[0m service_id     = (known after apply)
  [32m+[0m[0m service_url    = (known after apply)
[0m[1mmodule.vcl_service.fastly_service_vcl.main: Creating...[0m[0m
[0m[1mmodule.vcl_service.fastly_service_vcl.main: Creation complete after 4s [id=smahMcAdll56lpVWcV7wN1][0m
[0m[1m[32m
Apply complete! Resources: 1 added, 0 changed, 0 destroyed.
[0m[0m[1m[32m
Outputs:

[0mactive_version = 1
service_id = "smahMcAdll56lpVWcV7wN1"
service_url = "https://cfg.fastly.com/smahMcAdll56lpVWcV7wN1"

```

</details>